mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_AHBSC.h
#define AHBSC_SEC_CPU1_INT_MASK0_INT1_MASK_MASK  (0x2U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT1_MASK_SHIFT (1U)
/*! INT1_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT1_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT1_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT1_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT2_MASK_MASK  (0x4U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT2_MASK_SHIFT (2U)
/*! INT2_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT2_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT2_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT2_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT3_MASK_MASK  (0x8U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT3_MASK_SHIFT (3U)
/*! INT3_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT3_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT3_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT3_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT4_MASK_MASK  (0x10U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT4_MASK_SHIFT (4U)
/*! INT4_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT4_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT4_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT4_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT5_MASK_MASK  (0x20U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT5_MASK_SHIFT (5U)
/*! INT5_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT5_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT5_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT5_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT6_MASK_MASK  (0x40U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT6_MASK_SHIFT (6U)
/*! INT6_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT6_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT6_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT6_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT7_MASK_MASK  (0x80U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT7_MASK_SHIFT (7U)
/*! INT7_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT7_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT7_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT7_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT8_MASK_MASK  (0x100U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT8_MASK_SHIFT (8U)
/*! INT8_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT8_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT8_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT8_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT9_MASK_MASK  (0x200U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT9_MASK_SHIFT (9U)
/*! INT9_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT9_MASK(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT9_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT9_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT10_MASK_MASK (0x400U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT10_MASK_SHIFT (10U)
/*! INT10_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT10_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT10_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT10_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT11_MASK_MASK (0x800U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT11_MASK_SHIFT (11U)
/*! INT11_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT11_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT11_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT11_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT12_MASK_MASK (0x1000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT12_MASK_SHIFT (12U)
/*! INT12_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT12_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT12_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT12_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT13_MASK_MASK (0x2000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT13_MASK_SHIFT (13U)
/*! INT13_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT13_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT13_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT13_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT14_MASK_MASK (0x4000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT14_MASK_SHIFT (14U)
/*! INT14_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT14_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT14_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT14_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT15_MASK_MASK (0x8000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT15_MASK_SHIFT (15U)
/*! INT15_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT15_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT15_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT15_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT16_MASK_MASK (0x10000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT16_MASK_SHIFT (16U)
/*! INT16_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT16_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT16_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT16_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT17_MASK_MASK (0x20000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT17_MASK_SHIFT (17U)
/*! INT17_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT17_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT17_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT17_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT18_MASK_MASK (0x40000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT18_MASK_SHIFT (18U)
/*! INT18_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT18_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT18_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT18_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK0_INT19_MASK_MASK (0x80000U)
#define AHBSC_SEC_CPU1_INT_MASK0_INT19_MASK_SHIFT (19U)
/*! INT19_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK0_INT19_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK0_INT19_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK0_INT19_MASK_MASK)

