mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_AHBSC.h
#define AHBSC_SEC_CPU1_INT_MASK1_INT37_MASK_MASK (0x20U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT37_MASK_SHIFT (5U)
/*! INT37_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT37_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT37_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT37_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT38_MASK_MASK (0x40U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT38_MASK_SHIFT (6U)
/*! INT38_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT38_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT38_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT38_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT39_MASK_MASK (0x80U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT39_MASK_SHIFT (7U)
/*! INT39_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT39_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT39_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT39_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT40_MASK_MASK (0x100U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT40_MASK_SHIFT (8U)
/*! INT40_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT40_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT40_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT40_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT41_MASK_MASK (0x200U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT41_MASK_SHIFT (9U)
/*! INT41_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT41_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT41_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT41_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT42_MASK_MASK (0x400U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT42_MASK_SHIFT (10U)
/*! INT42_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT42_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT42_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT42_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT43_MASK_MASK (0x800U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT43_MASK_SHIFT (11U)
/*! INT43_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT43_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT43_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT43_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT44_MASK_MASK (0x1000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT44_MASK_SHIFT (12U)
/*! INT44_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT44_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT44_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT44_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT45_MASK_MASK (0x2000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT45_MASK_SHIFT (13U)
/*! INT45_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT45_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT45_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT45_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT46_MASK_MASK (0x4000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT46_MASK_SHIFT (14U)
/*! INT46_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT46_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT46_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT46_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT47_MASK_MASK (0x8000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT47_MASK_SHIFT (15U)
/*! INT47_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT47_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT47_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT47_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT48_MASK_MASK (0x10000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT48_MASK_SHIFT (16U)
/*! INT48_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT48_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT48_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT48_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT49_MASK_MASK (0x20000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT49_MASK_SHIFT (17U)
/*! INT49_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT49_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT49_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT49_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT50_MASK_MASK (0x40000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT50_MASK_SHIFT (18U)
/*! INT50_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT50_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT50_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT50_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT51_MASK_MASK (0x80000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT51_MASK_SHIFT (19U)
/*! INT51_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT51_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT51_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT51_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT52_MASK_MASK (0x100000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT52_MASK_SHIFT (20U)
/*! INT52_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT52_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT52_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT52_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK1_INT53_MASK_MASK (0x200000U)
#define AHBSC_SEC_CPU1_INT_MASK1_INT53_MASK_SHIFT (21U)
/*! INT53_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK1_INT53_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK1_INT53_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK1_INT53_MASK_MASK)

