mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_AHBSC.h
#define AHBSC_SEC_CPU1_INT_MASK2_INT72_MASK_MASK (0x100U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT72_MASK_SHIFT (8U)
/*! INT72_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT72_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT72_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT72_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT73_MASK_MASK (0x200U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT73_MASK_SHIFT (9U)
/*! INT73_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT73_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT73_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT73_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT74_MASK_MASK (0x400U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT74_MASK_SHIFT (10U)
/*! INT74_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT74_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT74_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT74_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT75_MASK_MASK (0x800U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT75_MASK_SHIFT (11U)
/*! INT75_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT75_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT75_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT75_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT76_MASK_MASK (0x1000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT76_MASK_SHIFT (12U)
/*! INT76_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT76_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT76_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT76_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT77_MASK_MASK (0x2000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT77_MASK_SHIFT (13U)
/*! INT77_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT77_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT77_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT77_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT78_MASK_MASK (0x4000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT78_MASK_SHIFT (14U)
/*! INT78_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT78_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT78_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT78_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT79_MASK_MASK (0x8000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT79_MASK_SHIFT (15U)
/*! INT79_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT79_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT79_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT79_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT80_MASK_MASK (0x10000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT80_MASK_SHIFT (16U)
/*! INT80_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT80_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT80_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT80_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT81_MASK_MASK (0x20000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT81_MASK_SHIFT (17U)
/*! INT81_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT81_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT81_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT81_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT82_MASK_MASK (0x40000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT82_MASK_SHIFT (18U)
/*! INT82_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT82_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT82_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT82_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT83_MASK_MASK (0x80000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT83_MASK_SHIFT (19U)
/*! INT83_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT83_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT83_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT83_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT84_MASK_MASK (0x100000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT84_MASK_SHIFT (20U)
/*! INT84_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT84_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT84_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT84_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT85_MASK_MASK (0x200000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT85_MASK_SHIFT (21U)
/*! INT85_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT85_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT85_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT85_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT86_MASK_MASK (0x400000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT86_MASK_SHIFT (22U)
/*! INT86_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT86_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT86_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT86_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT87_MASK_MASK (0x800000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT87_MASK_SHIFT (23U)
/*! INT87_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT87_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT87_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT87_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT88_MASK_MASK (0x1000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT88_MASK_SHIFT (24U)
/*! INT88_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT88_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT88_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT88_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT89_MASK_MASK (0x2000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT89_MASK_SHIFT (25U)
/*! INT89_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT89_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT89_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT89_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT90_MASK_MASK (0x4000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT90_MASK_SHIFT (26U)
/*! INT90_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT90_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT90_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT90_MASK_MASK)

